diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НовыеРеализации</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровИУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершении", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьАктыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтотОбъект);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработка.ЗагрузкаДанных.МодульОбъекта.СоздатьАкты");

КонецФункции

&НаКлиенте
Процедура ПриЗавершении(Результат, ДопПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		АдресРезультата = Результат.АдресРезультата;
		МассивСтруктур = ПолучитьИзВременногоХранилища(АдресРезультата);
		
		Для Каждого Строка Из МассивСтруктур Цикл
			НоваяСтрока = Элементы.НовыеРеализации.ДобавитьСтроку();
			НоваяСтрока.Договор = Строка.Договор;
			НоваяСтрока.РеализацияТоваровИУслуг = Строка.РеализацияТоваровИУслуг;
		КонецЦикла;
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
